# Start coding

In [1]:
import numpy as np
import pandas as pd

from pandas import Series, DataFrame

In [2]:
presocratics = Series(['Thales of Miletus','Anaximander','Anaximenes','Pythagoras','Xenophanes','Heraclitus','Parmenides','Empedocles','Anaxagoras','Democritus'])
presocratics

0    Thales of Miletus
1          Anaximander
2           Anaximenes
3           Pythagoras
4           Xenophanes
5           Heraclitus
6           Parmenides
7           Empedocles
8           Anaxagoras
9           Democritus
dtype: object

In [3]:
arche = Series(['water','apeiron','air','numbers','earth','logos','to be','four elements','seeds','atoms'])
arche

0            water
1          apeiron
2              air
3          numbers
4            earth
5            logos
6            to be
7    four elements
8            seeds
9            atoms
dtype: object

In [4]:
# Series with an index
arche2 = Series(['water','apeiron','air','numbers','earth','logos','to be','four elements','seeds','atoms'],index=[presocratics])
arche2

Thales of Miletus            water
Anaximander                apeiron
Anaximenes                     air
Pythagoras                 numbers
Xenophanes                   earth
Heraclitus                   logos
Parmenides                   to be
Empedocles           four elements
Anaxagoras                   seeds
Democritus                   atoms
dtype: object

In [5]:
#Show the values
arche2.values

array(['water', 'apeiron', 'air', 'numbers', 'earth', 'logos', 'to be',
       'four elements', 'seeds', 'atoms'], dtype=object)

In [7]:
arche2['Democritus']

Democritus    atoms
dtype: object

In [8]:
presocratics_arche = {'Philosopher':['Thales of Miletus','Anaximander','Anaximenes','Pythagoras','Xenophanes','Heraclitus','Parmenides','Empedocles','Anaxagoras','Democritus'],'Arche':['water','apeiron','air','numbers','earth','logos','to be','four elements','seeds','atoms']}

In [9]:
presocratics_frame = DataFrame(presocratics_arche)

In [10]:
presocratics_frame

         Philosopher          Arche
0  Thales of Miletus          water
1        Anaximander        apeiron
2         Anaximenes            air
3         Pythagoras        numbers
4         Xenophanes          earth
5         Heraclitus          logos
6         Parmenides          to be
7         Empedocles  four elements
8         Anaxagoras          seeds
9         Democritus          atoms

# DataFrame from the Internet

In [11]:
import webbrowser
website='https://en.wikipedia.org/wiki/The_World%27s_Billionaires'
webbrowser.open(website)

True

In [12]:
#Copy and read to get data
net_worth = pd.read_clipboard()

In [13]:
#Show
net_worth

   Year Number of billionaires Group's combined net worth
0  2020                  2,095              $8.0 trillion
1  2019                  2,153              $8.7 trillion
2  2018                  2,208              $9.1 trillion
3  2017                  2,043              $7.7 trillion
4  2016                  1,810              $6.5 trillion

In [14]:
net_worth.columns

Index(['Year', 'Number of billionaires', 'Group's combined net worth'], dtype='object')

In [15]:
DataFrame(net_worth,columns=['Year',"Group's combined net worth"])

   Year Group's combined net worth
0  2020              $8.0 trillion
1  2019              $8.7 trillion
2  2018              $9.1 trillion
3  2017              $7.7 trillion
4  2016              $6.5 trillion

In [16]:
net_worth.head(1)

   Year Number of billionaires Group's combined net worth
0  2020                  2,095              $8.0 trillion

In [17]:
net_worth.tail(1)

   Year Number of billionaires Group's combined net worth
4  2016                  1,810              $6.5 trillion